{"steamid": "76561198281231742", "description": {"sentiment": "positive", "features": {"exploration": ["I personally found it enjoyable, even without the presence of others.", "figured out the mechanics of the game alone and found a great deal of pleasure figuring out things on my own and exploring the world.", "the map is littered with many bandit camps and things of the like, so it never feels empty or lifeless while you are traveling."], "combat": ["the more abilities and perks you obtain via boss fights, the more the fights become enjoyable and more.. fluid.", "Visually and mechanically, it looks and feels nice fighting as you progress."], "multiplayer": ["boy was that a hoot.", "we all play in the same server and are part of a clan now, but we still are going our own individual paths.", "The server I have been playing in has been a pleasant one."]}}},
{"steamid": "76561197999928387", "description": {"sentiment": "positive", "features": {"Great gothic art style": ["The game has a great gothic art style that is visually appealing."], "PvE Combat is fun and challenging": ["The PvE combat is fun and challenging, especially with large groups of mobs."], "Weapon fighting styles feel unique and lend themselves to different tactics": ["The weapon fighting styles feel unique and lend themselves to different tactics."], "Spells are fairly diverse": ["The spells are fairly diverse."], "Interior decorating": ["The interior decorating is a nice feature."], "Plethora of server setting options to customize the experience and lessen the grind for solo play, if so desired": ["There are a plethora of server setting options to customize the experience and lessen the grind for solo play, if so desired."], "Castle layout changes are mostly fairly easy, especially when you set the resource return rate to 100% (because I'm gonna reorganize my castle design and NO, I will NOT grind for it!)": ["Castle layout changes are mostly fairly easy, especially when you set the resource return rate to 100%.", "Free movement of objects in your castle is a god-send."], "Some bosses are thrilling, nail-biting affairs with near-misses and clutch moments abound. (Bright Archer, Bandit King)": ["Some bosses are thrilling, nail-biting affairs with near-misses and clutch moments abound, such as the Bright Archer and Bandit King."], "The sense of humor": ["The game has a good sense of humor."]}}},
{"steamid": "76561197998552188", "description": {"sentiment": "positive", "features": {"Host your own PvE server": ["The ability to host your own server allows for more control over the game experience."], "Remove Castle Decay and Teleport Restrictions": ["Removing these restrictions makes the game more enjoyable and less frustrating."], "Halve the farm needed from items": ["Reducing the amount of farming needed makes the game less grindy and more fun."], "Reduce the waiting time for crafting items": ["Reducing the waiting time for crafting items makes the game more fast-paced and exciting."]}}},
{"steamid": "76561197972323182", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198030605607", "description": {"sentiment": "positive", "features": {"combat": ["Satisfying combat with gradually more challenging bosses", "Starts out feeling like a Souls title in combat", "Ends up making you feel incredibly powerful with proper cooldown management in combat"], "upgrade system": ["Good upgrade system tied to gear instead of XP (somebody else can grind for you if you don't have time and just wanna do the fun parts)"], "animal forms": ["New animal forms to help you navigate the map"], "castle": ["Castle offers more and more functionality"], "custom settings": ["Lets you run your own server with custom settings to tweak resource and combat difficulty"], "offline farming": ["Servants can farm a little for you while you're offline"]}}},
{"steamid": "76561197995325622", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561199006885006", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198049448956", "description": {"sentiment": "positive", "features": {"": []}}},
{"steamid": "76561198136806873", "description": {"sentiment": "positive", "features": {"Vampire movement and interaction": ["Lots of thought and purpose put into how the Vampire moves about and interacts with the outside world based on the lore/tales behind Vampires."], "Game quality": ["Super polished", "Way better quality than most AAA titles of late."]}}},
{"steamid": "76561198042436458", "description": {"sentiment": "positive", "features": {"open world/survival genre": ["If you like the open world/survival genre, the amount of farming/grinding/crafting/base building is satisfying enough."], "gear progression": ["Gear progression is balanced as well.", "The gear progression vs bosses getting harder is very well balanced."], "bosses": ["Currently there are 37 different bosses.", "All of them have different combat mechanics which is the strongest part of this game in my opinion.", "Bosses aren't that hard but isn't easy enough to faceroll unless you have way too high gear level and they were fun to play and kill."], "weapons and skill/spell options": ["You also have several weapons and skill/spell options to play with."], "unique mechanics": ["The game also has some unique mechanics like sun and blood mechanics which is fun in my opinion."]}}},
{"steamid": "76561198053642501", "description": {"sentiment": "positive", "features": {"genre": ["It's a well constructed, original and rich take on the genre of Survival PvP, with an added emphasis on PvE and RPG systems."], "gameplay": ["You can play the game without any PvP at all and still have a great time, in an experience akin to Valheim.", "You build your own vampire castle (with lots of cosmetic options), gaining new powers and knowledge for each boss you successfully hunt, while trying to navigate the different contested sources of resources to secure your development.", "The PvE bosses are enjoyable and well designed with varied, clear and recognizable attack patterns or AoEs to dodge.", "Most of them are accessible enough to be done solo while still providing a good challenge, which can encourage vampires to cooperate together.", "Servers can tweak their rules to differenciate themselves from one another, allowing for a variety of different playstyles.", "Enough content is already there."], "early access": ["Lastly, Early Access part is very generous. There is a lot of things to do, it's definitely not a \"wait until they add more content\" type of game.", "I would also not be scared of bugs and whatnot, as the devs have been extremely reactive already with patches and hotfixes. The two most problematic bugs I've known have lasted one day only, each."]}}},
{"steamid": "76561198004203970", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198067800008", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561198027362214", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561198259560829", "description": {"sentiment": null, "features": {}}},
{"steamid": "76561197962929757", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561197978521397", "description": {"sentiment": "positive", "features": {"combat system": ["The combat in this game is PHENOMENAL! Variety in builds between weapon and magic combinations and its easy to switch this as it costs nothing to switch your abilities (respec)."], "quality of life functions": ["Game has so many quality of life functions that others lack. Move buildings in build mode with full inventory. Auto extract items from inventory into a chest that are already in that chest!"]}}},
{"steamid": "76561197990439551", "description": {"sentiment": "positive", "features": {"PVP": ["Fighting feels very responsive and most spells need to be targeted and therefore can be dodged.", "Getting ganked is usually a death sentence but there are ways of avoiding combat while outnumbered.", "You can't really heal while in combat, the amount of health you can fully heal goes down as you take damage and while in combat you are flagged and can't heal above that threshold."], "PVE": ["Mobs don't seem to be re-skinned versions and the higher their level, the more abilities they have.", "Running into a village and slaughtering all the innocent civilians running around and screaming 'VAMPIRE!' is very satisfying."], "Building": ["There are a lot of cosmetic items that make up for the fact that you can't build vertically."], "Unique setting": ["The game has a unique setting."], "Early Access": ["For an Early Access title it's totally worth the money as there is plenty of content and tech to unlock."]}}},
{"steamid": "76561198079582802", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198049688798", "description": {"sentiment": "positive", "features": {"gathering resources": ["There is so much to do from gathering resources"], "building castles": ["There is so much to do from building castles"], "learning new spells": ["There is so much to do from learning new spells"], "upgrading everything": ["There is so much to do from upgrading everything"], "fighting bosses": ["There is so much to do from fighting bosses"], "rearranging stuff": ["I put so many hours into this game just rearranging my stuff like it was The Sims"]}}},
{"steamid": "76561198102905122", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198079823508", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561198069149241", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561198013396833", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561198025386746", "description": {"sentiment": "positive", "features": {"combat": ["The combat is way better"], "PvP": ["The game has PvP as a core design element"], "vampire experience": ["it's the best \"I am a Vampire\" experience available in modern gaming, in my opinion"], "gameplay hours": ["you can easily get 200 hours or more out of this game IN IT'S CURRENT STATE"], "price": ["this will be some of the best $20 you ever spent"]}}},
{"steamid": "76561198045692513", "description": {"sentiment": "positive", "features": {"Combat": ["Combat is fluid, hectic, and fun"], "Abilities": ["A plethora of abilities to choose from"], "Boss fights": ["Interesting boss fights"], "Survival": ["Not bogged down by survival meters"], "Exploration": ["Exploration is encouraged"], "Gameplay": ["V Rising shows the most promise out of all the Early Access titles I’ve played", "It feels similar to games like Diablo where you have free reign of the cursor to click on hordes of mobs to fight", "The ability tree is divided into categories of Unholy, Chaos, Frost, Blood, and Illusion", "Building your castle begins as you place foundations around your “Castle Heart”, the life source of the base that prevents it from decaying and allows you to upgrade and expand your territory", "Weapons have their own skills and moveset, depending on their rarity and type"], "Graphics": ["I love the atmosphere and how the dark and oppressive nature of the environment reflects the theme of Dracula", "From the autumn trees of Silverlight Hills to the gloomy and ghastly nature of the Cursed Forest, each biome offers a variety of visual delight as you explore every corner of the world"], "Multiplayer": ["Good solo and multiplayer content"]}}},
{"steamid": "76561198253349437", "description": {"sentiment": "positive", "features": {"accurate depiction of daily life": ["Finally a game that accurately depicts the average daily life of a gamer."], "unique gameplay mechanic": ["including taking damage from sunlight."]}}},
{"steamid": "76561197976043137", "description": {"sentiment": "positive", "features": {"core gameplay loop": ["The core gameplay loop is fun -- unlock technology, improve vampire, tackle boss to unlock technology/combat abilities, improve vampire, all whilst building up a proper gothic castle to live in"], "combat system": ["I like the way they've done the combat a lot, in particular the way you can change your loadout on the fly", "Combined with the blood types/potencies, there's a lot of room here to create fun builds", "Some bosses have felt undertuned, some overtuned, but there are some great fights"]}}},
{"steamid": "76561198308055278", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198072767144", "description": {"sentiment": "neutral", "features": {}}},
{"steamid": "76561198094003956", "description": {"sentiment": "negative", "features": {"": []}}},
{"steamid": "76561198132384109", "description": {"sentiment": "positive", "features": {"balance of combat, crafting and survival": ["The game has a good balance of combat, crafting and survival"], "simple game mechanism": ["all the mechanism is simple enough to understand"], "blood altar": ["Set the base wherever you want and construct a blood altar first. It will guide you to the location of bosses all over the map by revealing their blood trails.", "by doing that, tons of resources will be given as rewards which will eventually be used to upgrade your skills and equipment."], "replayability": ["After repeating this, what you do after is completely up to you. You may spend time decorating the base like a dark version of Stardew Valley, or trying to be the strongest vampire lord ever."]}}},
{"steamid": "76561198119404184", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198139127613", "description": {"sentiment": "positive", "features": {"exploring the map": ["had lots of fun"], "fighting enemies": ["had lots of fun"], "grinding for materials": ["need for crafting better equipment and improvements for your castle"], "vampire powers": ["insanely good", "Turning into an animal to blend in or to hide never failed to impress me"], "different skills": ["which you can switch, depending on what you like and what might get you the win"], "building a safe place": ["one of the many available locations"], "feeding off humans or animals": ["keeps you alive", "depending on the quality of the blood you might get some benefits like more speed, faster spell, more resources while farming, and so on"], "recommendation": ["V Rising has a lot to offer, and I can highly recommend it to play with or without friends"]}}},
{"steamid": "76561198110566439", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198029584875", "description": {"sentiment": "positive", "features": {"hand-crafted open world": ["The fact that the world is hand-crafted instead of procedurally generated makes it feel more unique and special."], "resource harvesting and technology tiers": ["I enjoy working my way up technology tiers and harvesting resources."], "base building": ["I love designing and building a base to facilitate my crafting and decorating it with a variety of options to show my sense of style."], "boss monster hunting": ["I enjoy the challenge of taking down unique boss monsters to gain advantages, abilities, and crafting unlocks."], "detailed server setup options": ["I appreciate the ability to customize the server settings to make enemies tougher, allow teleporting with resources, and increase stack sizes."], "lack of bugs": ["I appreciate the apparent complete lack of bugs in the game."], "guiding quests": ["I like the guiding quests that start as an effective tutorial but rapidly become milestones few and far between, letting me learn and play my own way."], "fishing": ["I like that the game includes fishing, because vampires fish."]}}},
{"steamid": "76561198018739243", "description": {"sentiment": "positive", "features": {"Content": ["You get a lot of content for 20 bucks in comparison to AAA titles that cost way more money."], "Building": ["Building your own castle with servants and sending them on missions is a lot of fun."], "Survival and combat aspect": ["The survival and combat aspect is well balanced."]}}},
{"steamid": "76561197965940511", "description": {"sentiment": "negative", "features": {"weapons and spells": ["It has a lot of fun weapons and spells"], "Co-Op": ["Co-Op you can be more relaxed and do fun stuff", "it's SO much better with friends"], "combat": ["while the combat is very fun"], "building castles": ["building castles"], "resource management": ["resource management"]}}},
{"steamid": "76561199151193969", "description": {"sentiment": "positive", "features": {"gameplay": ["One of my favorite games this year and one of the best survival games ever made.", "It cuts away all of the things that make survival games a tedious slog.", "This game is polished to a brilliant sheen."]}}},
{"steamid": "76561199103290854", "description": {"sentiment": "positive", "features": {"addicting": ["This game is addicting."], "progression": ["Progression is set up in a way you find yourself grinding out for the next set or item in order to progress a little bit further."]}}},
{"steamid": "76561198022142449", "description": {"sentiment": "positive", "features": {"level of customization": ["The level of customization you can apply to a dedicated server is insane.", "They took features that are MODS in other games and added it as a configurable option for the dedicated server.", "There are many, many exposed options for tailoring your experience how you want it to from that perspective because of this."], "ability to create experiences": ["It makes me feel awesome that I can create experiences without needing to Bepinex my way through the games code to tweak the experience."], "gameplay mechanics": ["Want a sun that is active for 1 hr per day and burns vampires into a crisp as soon as they start taking damage from it?", "Want to pick up 3 rats from a single one and compress 50 of them them into the same slot in your inventory?", "Destroyed as soon as silver touches you? Do it.", "Garlic so strong it makes you cry irl? We got it.", "Research/Crafting/etc. time modifiers shorter than the time it takes for a vampire hunter to put you on a milk bottle? Just one numerical change away."], "overall game experience": ["Oh yeah the game is cool as heck too, not just the ability to make awesome experiences via the dedicated servers hahaha.", "Should give it a try, you'll probably like it!"]}}},
{"steamid": "76561198159884113", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198126469867", "description": {"sentiment": "positive", "features": {"Horses control": ["control is smooth and intuitive"]}}},
{"steamid": "76561198096208196", "description": {"sentiment": "positive", "features": {"immortal vampire concept": ["For me, it captures the idea of an immortal vampire perfectly.", "Your nature is clear. You feast on mortals to savour the benefits of their blood, be it a worker to boost your gathering, a scholar to vastly empower your spellcasting, a brute to relish in the melee slaughter - you get the idea."], "castle building and customization": ["Get back to your grand castle.", "You could hunt for some good humans, scouring the streets for high end blood to bring back to your castle for your dark delights, be it imprisoning them in your own personal wineyard, or turning them into a vampire spawn/servant to roam your halls, guarding your castle or heading out on missions."], "combat mechanics": ["The combat, which is the greatest i have had the pleasure to immerse myself in.", "Hunting powerful V-bloods to progress through the different tech stages, and unlocking powerful new spells that will allow you to greatly mix up your playstyle."], "fresh take on survival setting": ["If you are still reading this review, give it a try. It is a fresh take on the survival setting, and it has completely consumed my free time."], "potential for updates": ["I cant wait for updates, if this is only the early access, the launched product is going to be a sight to behold.", "If for some reason you do not feel it is worth the current cost, keep track of the game updates, the game is already a steal for the current cost."]}}},
{"steamid": "76561199089186978", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198014916388", "description": {"sentiment": "negative", "features": {"basebuilding": ["The basebuilding is fairly fun and really lets you make your spooky vampire castle."]}}},
{"steamid": "76561198256780267", "description": {"sentiment": "positive", "features": {"exploration": ["Valheim's exploration system was mixed in and it works great."], "boss hunts": ["Valheim's boss hunts were mixed in and it works great."], "crafting system": ["Valheim's crafting system was mixed in and it works great."], "open world pvp": ["Rust's open world pvp system was mixed in and it works great."], "survival": ["Rust's survival system was mixed in and it works great."], "looting monuments": ["Rust's looting monuments system was mixed in and it works great."], "raiding system": ["Rust's raiding system was mixed in and it works great."], "combat system": ["Battlerite's combat system was mixed in and it works great."], "gameplay": ["If you even remotely like the games mentioned above, this is a gem."]}}},
{"steamid": "76561198036910462", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198437641317", "description": {"sentiment": "unknown", "features": {}}},
{"steamid": "76561197992764570", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198380869259", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198415715255", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561197968469521", "description": {"sentiment": "positive", "features": {"gameplay": ["I'm amazed how small indie devs keep creating incredible games like V Rising", "Played co-op with a good friend and it was a blast"]}}},
{"steamid": "76561198147003575", "description": {"sentiment": "positive", "features": {"fun": ["The game was enjoyable to play"], "interesting": ["The game was engaging and kept my attention"], "controller support": ["The game would benefit from full controller support"]}}},
{"steamid": "76561198940138487", "description": {"sentiment": "positive", "features": {"content": ["The amount of content in this was massive."]}}},
{"steamid": "76561198052274962", "description": {"sentiment": "positive", "features": {"Incredible game": ["My wife and I get lost in this for days at a time", "Awesome experience", "Highly recommend"]}}},
{"steamid": "76561198093828113", "description": {"sentiment": null, "features": {}}},
{"steamid": "76561198059724281", "description": {"sentiment": "positive", "features": {"Combat": ["Very fluid and very impactful feeling in everything you do", "Being resourceful can make a huge difference in your success in fights"], "Bosses": ["Fun and required strategy", "Switching spells and trying different ideas a lot to take down certain challenges"], "Base Building and Crafting": ["Well thought out for a lot of it", "If you love building your own custom castles, this is the game to do it"]}}},
{"steamid": "76561198073029923", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198007979893", "description": {"sentiment": "positive", "features": {"castle building": ["At over 1000 hours played so far (check my Steam if you don't believe me), I don't get tired of building castles at end game.", "It's fun finding decayed castles and claiming items from others too, you never know what you're gonna find, and getting exceptionally rare shinies is always exciting.", "That, and it opens plots for new players who haven't yet learned how to take down castles."], "polished game with few bugs": ["It is early access, but the game is very polished and has few bugs."], "exciting rare items": ["getting exceptionally rare shinies is always exciting."], "future updates and content releases": ["Looking forward to future updates and content releases, and hopefully more amazing cosmetic items.", "For anyone looking to read about future content, you can read about it on the Stunlock studies blog listed here: https://blog.stunlock.com/dev-update-15-future-visions/"]}}},
{"steamid": "76561197998882576", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561198369644056", "description": {"sentiment": "positive", "features": {"balance": ["Everything is more balanced"], "building": ["players can't grief by building on top of your exits", "you can build multi-story now"], "weapon variety": ["there's more weapon variety"], "QOL improvements": ["being able to send servants you just captured directly to jail with a skill, no need to haul them around now risking them dying"], "beta-testing": ["they fixed a lot of bugs during the beta-testing"], "listening to players": ["Stunlock listened to the players, and in turn, made an excellent DLC"]}}},
{"steamid": "76561198105833798", "description": {"sentiment": "positive", "features": {"breeding": ["You can breed rats <3"]}}},
{"steamid": "76561198072962497", "description": {"sentiment": "positive", "features": {"gameplay": ["It's like combining Harvest Moon with Diablo.", "You can run around, fighting creatures and humans till your gear breaks and then head back to your home made castle to repair and decorate.", "The game is so much better with friends~"], "multiplayer": ["It really helps to get a group of friends together to play, or at least reach out on a nice server to see who would help you.", "PLAY the game with a friend. You get a group of friends together, especially internet friends. You can keep each others castle hearts filled. You can designate one person as the study guy and hand all your paper and books to them to get all the items filled out. You can pool resources together to keep everyones gear at a high level!"]}}},
{"steamid": "76561198379491100", "description": {"sentiment": "positive", "features": {"Graphics": ["Beautiful"], "Gameplay": ["Very good"], "Audio": ["Very good"], "Audience": ["Teens", "Adults"], "PC Requirements": ["Decent"], "Difficulty": ["Significant brain usage"], "Grind": ["Only if u care about leaderboards/ranks"], "Story": ["No Story"], "Game Time": ["To infinity and beyond"], "Price": ["Worth the price"], "Bugs": ["Minor bugs"], "? / 10": ["9"]}}},
{"steamid": "76561198128160159", "description": {"sentiment": "positive", "features": {"Valheim meets Vampires": ["The combination of these two elements makes for a unique and enjoyable gameplay experience."], "Good Character Growth": ["The character development throughout the game is well-done and satisfying."], "Good Choice of Character Builds": ["The variety of character builds available adds to the replayability of the game."], "Map doesn't feel empty": ["The game world is well-populated with interesting locations and NPCs."], "Servant system is pretty cool": ["The servant system adds an interesting dynamic to the gameplay."], "Only seen one bug": ["The game seems to be relatively bug-free, which is always a plus."]}}},
{"steamid": "76561198054807464", "description": {"sentiment": "positive", "features": {"dev support": ["The dev checking in on the server the first hour after launch and asking if everyone was having a smooth experience made me feel like the devs care about their craft and want it to succeed."], "castle progression mechanic": ["The rewarding castle progression mechanic was enjoyable."], "combat": ["Easy to play hard to master combat was great."]}}},
{"steamid": "76561198122986494", "description": {"sentiment": "positive", "features": {"base building": ["The base building aspect of the game was really enjoyable and added a new layer of strategy to the gameplay."], "multiplayer": ["The multiplayer aspect of the game was a lot of fun and added a lot of replay value."]}}},
{"steamid": "76561197999097442", "description": {"sentiment": "positive", "features": {"Combat": ["Combat is largely dependent on skill and not on RNG (very much a good thing in my opinion).  Meaty and satisfying."], "Building castles": ["Building castles is great fun, as is sending minions on missions"], "Character progression": ["Your character feels powerful but not invincible - bosses are challenging but persistence and practice will get you through eventually."], "PVE": ["PVE - cooperative play is an absolute blast.  Share victory, share defeat, share that story of how your friend got absolutely mauled by a golem that one time..."], "Vampires": ["Vampires are just cool, alright.  I just think they're neat!"]}}},
{"steamid": "76561198046311327", "description": {"sentiment": "positive", "features": {"combat mechanics": ["The game combines the polished (tried-and-true) combat mechanics from Battlerite with a full loot open world environment."], "open world environment": ["The game combines the polished (tried-and-true) combat mechanics from Battlerite with a full loot open world environment."], "dynamic enemies and NPC's": ["Enemies and NPC's are dynamic and at odds with each other."], "challenging bosses": ["Bosses are challenging, fun, and rewarding to beat."], "castle building": ["Castle building is very satisfying."], "shapeshifting": ["Shapeshifting is a great feature that adds to the gameplay."], "human dominance": ["Human dominance is a unique feature that adds to the gameplay."], "servants": ["Servants are a great addition to the game."], "fishing": ["Fishing is a fun and relaxing activity in the game."], "limited team sizes": ["Team sizes are limited to dissuade 'zerging' (as is common in the genre)."]}}},
{"steamid": "76561198346112983", "description": {"sentiment": "positive", "features": {"pve": ["The PVE is awesome"], "potential": ["A game with a lot of potential"], "dungeons": ["Adding dungeons can take the game to another level"], "maps": ["More areas or maps can take the game to another level"], "vampire hubs": ["Adding vampire hubs can take the game to another level"], "professions": ["Adding professions can take the game to another level"]}}},
{"steamid": "76561198190159561", "description": {"sentiment": "positive", "features": {"gameplay": ["It has quick hack and slash with spells which makes it an interesting game-play.", "The PvE elements have their own beef with eachother, so you can always be creative and use the environment to your cause."], "graphics": ["Graphics are very nice considering it's a top-down game.", "The fact that you are a vampire, makes the day-night cycle special to you and it is quite balanced with addition of blood moon."], "pve": ["You really enjoy PvE elements so for those who are not into PvP, the PvE has enough content to keep you going!"], "leveling system": ["The grind is decent and leveling system is fair."]}}},
{"steamid": "76561197986090780", "description": {"sentiment": "positive", "features": {"graphics": ["The graphics are nice, the lighting works well and night and day are remarkably different experiences visually."], "bosses": ["The bosses are varied enough to feel fun, although the first half of the bosses are simply just enhanced mobs, and the last few bosses are where it gets more interesting and challenging.", "There is a need to plan the time you engage these bosses, as the game's day night cycle means that in the day when the sun is out you can possibly be caught in an arena basked in sunlight, which casts a deadly ray on your vampire that can quickly finish you off."], "castle building": ["The castle building is decent, and utilizes a gridbased expansion and construction system.", "Where the base building gets unique is the introduction of prison cells that allow you to lure charmed NPCs with a high blood quality back, imprisoning them and turning them into livestock."], "combat": ["The combat is quite engaging, it allows you to pick two spells, an ultimate and you have three weapon skills preset based on what weapon you are using.", "There are some neat combos here, and the telegraphing and real time evasion of attacks provide for a rather fun combat system that you can get better at with play."], "co-op": ["The game does have a lot of potential and is a blast to play with friends."], "price": ["Early Access, keep an eye, decent for its price."]}}},
{"steamid": "76561198013940399", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198020050583", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198038820071", "description": {"sentiment": "positive", "features": {"playing as a vampire": ["This game allows you to play as a vampire and experience the life of a vampire in the land of the living."], "survival aspect of the vampire": ["The game has a unique concept of survival aspect of the vampire, where you have to escape from the sun as the morning comes, or hunt for blood to keep you alive.", "It makes you feel vulnerable as a vampire rather than an immortal powerful creature like in many other vampire games."], "playing with other vampires": ["You can play with other vampires (PvE) in an open world up to 40 players, survive in the living world together, build together and help each other thrive and get stronger."], "unique in survival/crafting genre": ["The game is quite unique in the survival/crafting genre."], "huge contents for you to explore": ["The game is in Early Access, yet it has huge contents for you to explore."]}}},
{"steamid": "76561197970398939", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561198128814237", "description": {"sentiment": "positive", "features": {"Graphics": ["Beautiful"], "Gameplay": ["Good"], "Audio": ["Good"], "Difficulty": ["Easy to learn / Hard to master"], "Grind": ["Average grind level"], "Story": ["Some lore"], "Game Time": ["Average"], "Price": ["If it's on sale"], "Bugs": ["Minor bugs"]}}},
{"steamid": "76561197993947538", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561198030752858", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561198799228628", "description": {"sentiment": "positive", "features": {"community": ["met a lot of extremely lovely players that helped others out"], "server selection": ["You just have to do research on how each servers are. Sorta just like how you would for an MMO.", "Some may end up being more PvP based or some others are more calm, and help each other out with PVE.", "PLEASE DO YOUR RESEARCH, OR HELL, EVEN ASK ME!"], "developer support": ["there is A LOT of ignorant players that ignore the fact that updates take time, even with a smaller company of 31 team members in Stunlock Studios.", "Stunlock, you're doing great, keep up the awesome work!"]}}},
{"steamid": "76561198057834485", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198254079115", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561197996565477", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561197963356542", "description": {"sentiment": "positive", "features": {"Combat Gameplay Loop": ["The WASD controls for this game is fluid so the combat is very fluid."], "Gathering Gameplay Loop": ["You can farm enemies for materials and for blood.", "You can enslave strong humans to harvest their strong blood to give you stronger stats.", "You also can use your materials to decorate your castle, which you have many options to create some beautiful ominous castles."], "Player Interaction": ["Your clan's resources can be shared, so if you have a clan of 4, you can choose to build 1 castle and level that single 1 up very high instead of building multiple low level castles.", "Pro Tip: if your quest requires you to build a specific building, you can interact with your clanmate's building to complete that quest."]}}},
{"steamid": "76561197961984825", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198190728666", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561197996361189", "description": {"sentiment": "positive", "features": {"gameplay progression": ["The gameplay progression is fun, kill named monster, gain new ability from monster, proceed to upgrade your tech to take on the stronger monsters."], "weapon variety": ["The weapon variety is fun."], "spells": ["The spells are fun."], "ultimate abilities": ["The ultimate abilities are fun."], "movement": ["Feels great to move around in, WASD was a little weird at first if you're coming to this from like Diablo or POE, but the freedom with the camera makes it work, and I kinda wish more games would adapt it now."], "multiplayer": ["When a server is active seeing fellow vampires is great, teaming up with them to slay the mortals/monsters if fun, making clans, etc."]}}},
{"steamid": "76561198087305987", "description": {"sentiment": "positive", "features": {"true-to-folklore mechanics": ["The true-to-folklore mechanics remind you that, while you are a very powerful undead creature -- you have rules to play by."], "grass blocking with magic bone fog": ["Grass that doesn't get sunlight because you are blocking it out with magic bone fog with wither over time was impressive."], "lovingly made assets": ["The assets are all lovingly made, and it is easy to make castles that look like something you could find in a AAA title."], "randomized dirt and grime for floor tiles": ["The floor tiles have randomized dirt and grime for the workshop, so it doesn't just look like repeating tiles."]}}},
{"steamid": "76561198018470005", "description": {"sentiment": "positive", "features": {"bug-free": ["So far, no bug."], "frame rate": ["No frame rate issue with my old and new machines."], "vampire gameplay": ["It is fun to play as a vampire whereby there ain't many good vampire RPG out there."], "base building": ["A bit of base building and survival (crafting)."], "combat": ["A bit of combat."], "boss fights": ["Boss fights are interesting."], "online play": ["I have tried online play whereby time doesn't stop (server is 24x7). It has its own challenge in maintaining the base."], "private server": ["Personally I prefer private server to learn the game at my own pace (and my own ruleset)."], "time commitment": ["This game demands a lot of time commitment though."]}}},
{"steamid": "76561198034492781", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561198069473651", "description": {"sentiment": "positive", "features": {"slider": ["A slider to adjust width and length would do wonders"], "gameplay": ["Fantastic Game otherwise!"]}}},
{"steamid": "76561198289200795", "description": {"sentiment": "positive", "features": {"transformation mechanics": ["I really love the transformation mechanics where you can turn into something else"], "base building": ["building your base is also really fun"]}}},
{"steamid": "76561198074604159", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561198868317946", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198135913580", "description": {"sentiment": "positive", "features": {"Game mechanic": ["I do like the game mechanic because it is well-designed and enjoyable to play."], "graphic": ["I do like the graphic because it is visually stunning and immersive."], "craft": ["I do like the crafting system because it is well-implemented and adds depth to the gameplay."], "base building": ["I do like the base building because it allows me to create my own unique structures and defend against enemies."], "Bosses fights": ["I do like the boss fights because they are challenging and rewarding."]}}},
{"steamid": "76561198080410271", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198840142672", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561197980178164", "description": {"sentiment": "positive", "features": {"combat": ["The combat is fluid, and fun."], "world design": ["The world is just dangerous enough, for just long enough in the areas you are progressing through to teach you to watch your self and not just run through everywhere.", "The details of the world are well though out, and each area feels different."], "boss fights": ["Each boss fight is unique."], "progression": ["Progression is solid."], "crafting": ["The crafting is not quite on Valheim level but more like a sims game. Still amazing, and a ton of things you can do in order to make your castle your own."]}}},
{"steamid": "76561198021193400", "description": {"sentiment": "positive", "features": {"combat": ["The combat is responsive and fun, with various abilities/spells to choose from as you keep drinking V Blood (the bosses of the game).", "It suits different play styles, with each ability tree being unique in what they do."], "building": ["A fantastic all around experience. From the combat to the building, the game offers a diverse set of options to choose from."], "customization options": ["The game offers various settings to make life easier for you, like loot drop multipliers, resources gathered multipliers and you can even adjust and tweak your own physical damage and spell damage, which is a very welcome addition to tailor the experience to your needs."], "immersive": ["In short (for PvE at least), a great combat, building and immersive game with great customization options to create your own experience however you like without the constraints that games usually have in place."]}}},
{"steamid": "76561198031599084", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561199064620561", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198048169385", "description": {"sentiment": "neutral", "features": {"Controller support": ["Customer requested the addition of controller support"]}}},
{"steamid": "76561198125483897", "description": {"sentiment": "positive", "features": {"single player": ["The game is a lot of fun as a single player."], "multiplayer": ["The game really shines when played with friends."], "character transfer": ["Be careful what server you choose to play as characters are non transferable!"]}}},
{"steamid": "76561198004837608", "description": {"sentiment": "positive", "features": {"gameplay": ["This game is like a crossover between RUST and Don't Starve Together.", "It's already fully playable right from the box, without any major noticeable bugs."], "completeness": ["Feels like a complete game already."]}}},
{"steamid": "76561198328917542", "description": {"sentiment": "positive", "features": {"Building and decorating castle": ["One thing I really enjoyed was building and decorating my castle. It has a pretty robust building system with a lot of items and patterns so you can decorate a gothic castle and garden that left myself and others comparing our shenanigans to The Sims, not gonna lie.", "With some creativity, you can have fun with it. I am finding myself spending a lot of time planning out the pathways of the garden and choosing coordinating paintings carefully."], "Graphics and setting": ["This game got me in the mood for vampire lore and vampire fiction. The graphics and setting are gorgeous and crafted very well.", "The subtle strings and ambient sounds added to the experience so much."], "Leveling up mechanics": ["Leveling up is unique and done through your gear and defeating bosses instead of the typical RPG mechanics so there is not much fiddling with menus and no messing with stats.", "It's all pretty grab-and-go easy, you just know what is more powerful than your current kit and go. It's pretty intuitive and makes progression fun."], "Appeal to a broad genre of players": ["I think V rising is a game that can appeal to a broad genre of players - guys and their girlfriends."]}}},
{"steamid": "76561198053997827", "description": {"sentiment": "positive", "features": {"gameplay": ["This game was amazing when it was first released.", "If you want to play a super fun game with friends that has done an amazing job taking care of their customer base, this is a real contender. Play it."], "free content": ["Just FREE CONTENT. You know, that stuff people used to play games for?"], "customer service": ["the devs actually decided to give us more", "taking care of their customer base"]}}},
{"steamid": "76561198393949788", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561198066018764", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561199032872345", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561198276154516", "description": {"sentiment": "positive", "features": {"gameplay": ["up to 4p co-op PVP or PVE", "Open world", "CASTLE base building", "blood level, type, & thirst management", "research system & tiered boss eliminations for progressing", "Fast paced, unforgiving PVP combat will full loot system if one chooses", "very relaxing & addicting IMO", "small, but easy learning curve to master"], "technical stability": ["very stable, no technical issues on my end unlike COD MW2"], "release date": ["Just recently came out last year 5/17/22"], "surprise enjoyment": ["I never thought I'd enjoy a vampire game let alone play it for almost 12 hours straight & miss sleeping because of it", "I don't know how I missed a hidden gem like this"]}}},
{"steamid": "76561197994002775", "description": {"sentiment": "positive", "features": {"MMO": ["V Rising is a great MMO with PvE & PvP servers"], "vampire elements": ["The game also has elements that cater to the fact that you are a vampire.", "Bloodsucking is also an important part.", "You have different blood types that come with their own benefits.", "Depending on how powerful your victim's blood was, there are multiple effects and the effects are stronger.", "There are also special enemies that you can find through a blood altar.", "You must defeat those enemies if you want to gain certain powers, learn specific recipes, and build specific parts for your base."], "resource management": ["Everything you can build and make, you need resources for that.", "You can cut trees, grass can cut you and stone can cut you.", "And you need a lot of everything, I can tell you.", "As you upgrade your vampire, more abilities are unlocked and you can build more things and mine resources as your tools become stronger as well."], "ultra-wide resolution support": ["V Rising also has perfect support for ultra-wide resolutions such as 3840*1080"]}}},
{"steamid": "76561199121410966", "description": {"sentiment": "positive", "features": {"art style and graphics": ["The art style and graphics of the game are gorgeous and work so smoothly for a game only in Beta."], "DEVs": ["The DEVs are truly in love with their players and their games.", "They are truly masters of their craft and friends of the community."], "survival game": ["It's the only survival game that's actually pulled me into every little detail."], "being able to turn into a rat and toad": ["You can't go wrong with being able to turn into a rat and toad."]}}},
{"steamid": "76561198102131901", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198072868866", "description": {"sentiment": "positive", "features": {"gameplay": ["Feels like Diablo and Crafting sims had a baby for shits and gigs", "feels fun and great"]}}},
{"steamid": "76561198063554822", "description": {"sentiment": "positive", "features": {"resource and teleport setting": ["The ability to adjust resource and teleport setting helped cut down the grind by a lot."]}}},
{"steamid": "76561197965976363", "description": {"sentiment": "positive", "features": {"PvP dueling and wars": ["It'd be cool if you could duel people on PvE, declare wars, maybe have set PvP zones in the game (ie arenas) where you're automatically flagged while inside, stuff like that to spice things up."], "Equalized gearscore in PvP": ["PvP servers should have equalized gearscore when engaged in PvP to make it at least fair."], "Fun gameplay": ["Game is still fun enough as is."]}}},
{"steamid": "76561197993721647", "description": {"sentiment": "positive", "features": {"gameplay": ["Controls are snappy and responsive", "Neither combat, gathering nor building are tedious in any way", "The game is in a very polished state despite the Early Access stamp"], "progression": ["Progression is largely tied to the bosses you kill, giving you a natural reason to build a base and then go hunt for them", "Every boss rewards you with some new tech or ability", "Your gear score is entirely tied to your equipment, which is the only way to actually level in V Rising"], "vampire mechanics": ["You need to drink blood to survive and refill your ever-decreasing blood meter", "Passive abilities are granted based on the type of enemy you took a bite out of", "Everyone has a random blood quality percentage assigned to them and the better it is, the more buffs you get for your \"class\"", "You can swap classes as easily as just draining a different host", "You can stick to the shadows during the day and be totally fine"], "multiplayer": ["The game design rewards having at least some other players around to cooperate with", "The game can support immense player numbers"]}}},
{"steamid": "76561197992193919", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198098229578", "description": {"sentiment": "positive", "features": {"gameplay mechanics": ["awesome mechanics"], "graphics": ["looks great"], "castle feature": ["love the fact that your castle has a heart that you have to feed. It makes you more invested in the game and it gives you co-op options that a lot of games just don't have."]}}},
{"steamid": "76561198172429306", "description": {"sentiment": "positive", "features": {"gameplay": ["A truly unique and an innovative gameplay has been achieved here."], "balance": ["This game is a great balance between the PvP, building, resource gathering and farming."], "lore": ["Some lore"], "castle": ["the main point as we have guessed is to just have a huge and beautifully made castle."]}}},
{"steamid": "76561198114937311", "description": {"sentiment": "positive", "features": {"friends": ["It is better with friends."]}}},
{"steamid": "76561198072524174", "description": {"sentiment": "neutral", "features": {}}},
{"steamid": "76561198027135711", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198099986382", "description": {"sentiment": "neutral", "features": {}}},
{"steamid": "76561198000515287", "description": {"sentiment": "positive", "features": {"gameplay loop": ["The gameplay loop is also fun.", "V Rising does both survival and combat aspects of the game very good."], "survival aspect": ["only Valheim and V Rising made the survival aspect of the game actually not annoying."]}}},
{"steamid": "76561198060209155", "description": {"sentiment": "positive", "features": {"settings": ["The settings to the game is extensive, so you really can make the most out of the game by altering it to your liking.", "Want mobs to drop more loot? No problem, just set it up in the settings.", "Want to make the game easier? No problem, just buff yourself and lower the mobs output.", "Want to make it more difficult? There's tons of opportunity to do just that as well."], "performance": ["For an early access game, this has also performed smoothly.", "I've only run into 1 issue and a restart solved it and I haven't seen it since!"]}}},
{"steamid": "76561198052909865", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198049161362", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561197996450068", "description": {"sentiment": "positive", "features": {"Basebuilding": ["very well done and easy"], "Combat": ["Fantastic combat that gets deeper and deeper", "Diablo/Grim Dawn style combat"], "Fun factor": ["high"], "Audio": ["good"], "UI": ["good"], "Mounts": ["well done"], "Server setup": ["Easy to start up a server to play with friends or yourself (Or join PVP servers where bases can get raided, lost loot,etc..)"], "Movement": ["good"], "Content": ["TONS of content already!"], "Atmosphere and setting": ["Legacy of Kain Survival/action rpg I always dreamed of"], "Price": ["for $22 its a real steal"], "Comparison to other games": ["Best survival game since Valheim without question", "Valheim's basebuilding allows for more customization and has randomly generated worlds, but I find V Risings combat to be better and there are alot more abilities to", "Both great games!"]}}},
{"steamid": "76561197983542721", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198065648581", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561198083307021", "description": {"sentiment": "positive", "features": {"atmosphere": ["V Rising is a gorgeous, atmospheric, vampire survival experience."], "exploration": ["Explore forests, caverns, mining shafts, and many more beautiful areas to discover scarce and valuable resources to build and grow your armoury and weaponry."], "combat": ["The combat feels very Diablo/Torchlight, which I adored right off the bat."], "base building": ["V Rising has base building, which was something that I was not expecting it to have. I'm so glad that this is a feature they added in because it just fits perfectly into this world *chefs kiss*."], "boss battles": ["You will have to fight a diverse amount of bosses in order to discover more recipes/ingredients and even new powers!"], "addictive gameplay": ["It's incredibly easy to just get lost in V Rising and never run out of things to do. It's one of those games that you tell yourself, \"Okay, after I collect a bit of copper ore, I'll get off\"... And then proceed to keep playing for the next 5 hours LOL. It's a very fun game and quite easy to just get sucked in."]}}},
{"steamid": "76561198381703420", "description": {"sentiment": "positive", "features": {"Building": ["V Rising found that perfect balance of the building, combat, some lore, and exploration.", "You’ll kill people, you’ll turn into various animals, build a castle, tussle with vampire hunters, and strip-mine several hundred acres of verdant woodland to build that new armoire with matching end table you’ve had your eye on."], "Combat": ["To add a little challenge to what could simply be an open-world vampire survival game MMORPG, players could burn and die in the sunlight.", "Combat is fun and strategic", "Your role as a vampire lord is more than just a gimmick"], "Exploration": ["V Rising found that perfect balance of the building, combat, some lore, and exploration."], "Graphics": ["Graphics, sound and overall game design are great"], "Sound": ["Graphics, sound and overall game design are great"], "Storyline": ["V Rising found that perfect balance of the building, combat, some lore, and exploration."], "Dynamic world": ["Another thing I love about V Rising is how dynamic its world is, which isn't always a common trait of survival games. Pretty much everything is hostile towards you, but many creatures and entities are hostile towards each other as well.  You can also strategically bait one group of mob into another."], "Addictive gameplay loop": ["Addictive gameplay loop"]}}},
{"steamid": "76561198009781176", "description": {"sentiment": "positive", "features": {"exploring": ["exploring and defeating bosses is rewarding and you are always excited about what's the new thing you will unlock next"], "art": ["The art is really cool for the genre"], "combat": ["combat is fun"]}}},
{"steamid": "76561198163276073", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561198035391503", "description": {"sentiment": "positive", "features": {"world": ["A fantastic world"], "combat system": ["Great combat system", "Combat feels fantastic as well"], "content": ["Already tons of content", "The amount of content available is solid (30+ bosses)"], "building": ["Building is easy and goes fast"], "offline play": ["You can play OFFLINE with NO CONNECTION"], "price": ["For the price they ask, it is a steal"]}}},
{"steamid": "76561198002330346", "description": {"sentiment": "positive", "features": {"gameplay mechanics": ["feels a lot like Valheim and Albion, but straight better than Albion in most ways Imo"]}}},
{"steamid": "76561198981027271", "description": {"sentiment": "positive", "features": {"price": ["The price of a medium pizza is a steal for this game."], "potential": ["The game looks super promising and has great potential, especially in co-op."], "gameplay": ["Highly recommend playing in PvP mode to get the most out of the experience."], "comparison": ["If you enjoyed Valheim or survival games in general, this is a must-have. In my opinion, this is better than Valheim and one of the better survival games to date, and it's only in early access."], "dlc": ["A shame DLC is offered already, cosmetic or not. However, not a deal breaker."], "recommendation": ["Worth a buy 👍."]}}},
{"steamid": "76561198036515969", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198028091020", "description": {"sentiment": "positive", "features": {"crafting system": ["There is a clear rhythm in the game's crafting system.", "This game manages to streamline it all in a way so that you can enjoy the \"leveling up your gear and castle\" aspect of the game, without the super tedious grind."], "day and night cycle": ["One shining feature to the game, is the day and night cycle, and its influence on your gameplay.", "When the sun is out, as a vampire you have a natural aversion to it. If you stand in it too long, you will take a lot of damage. So traversing the world during the day is engaging, as the shadows shift, and have you think on your feet. Doing this during battles is even more exciting."], "battles": ["Speaking of battles, it's the best part of the game.", "If you've played Stunlock's previous game, Battlerite, you will feel right at home here.", "Every attack feels meaty.", "Boss fights were a highlight for me. They are all interesting and intense to fight. They make snarky quips, and you know there will always be an exciting progression reward at the end."], "vampire features": ["There are a lot of smaller features that make the game so enjoyable too. Raising the undead to kill and farm them for materials, keeping your castle healthy by feeding it blood, and charming humans are such fun little vampire features I haven't experienced in other games."]}}},
{"steamid": "76561198086671682", "description": {"sentiment": "positive", "features": {"mechanics": ["Valheim for its mechanics, bosses, mini bosses and loot system"], "graphics": ["It's got beautiful scenery and great graphics"], "base building": ["Such a great base game with a [huge] possible future and room to expand"], "bossing": ["If you enjoy base building, bossing, looting and grinding this is definitely the game for you"], "looting": ["If you enjoy base building, bossing, looting and grinding this is definitely the game for you"], "recommendation": ["Huge Recommend from me"], "updates": ["Please for the love of gaming stay committed and don't stop progressing this game with updates and DLC's"], "DLCs": ["Please for the love of gaming stay committed and don't stop progressing this game with updates and DLC's"]}}},
{"steamid": "76561198107748405", "description": {"sentiment": "positive", "features": {"charm": ["This game has amazing charm"], "gameplay": ["It works damn well"]}}},
{"steamid": "76561198270139259", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561197985393399", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198044042958", "description": {"sentiment": "positive", "features": {"top-down hack-and-slash": ["The gameplay was engaging and fun."], "base building": ["It added an extra layer of strategy to the game."], "vampires": ["The vampire theme was unique and interesting."]}}},
{"steamid": "76561198136514275", "description": {"sentiment": "positive", "features": {"gameplay": ["This game has brought my son and I closer again and now we actually spend time together outside the house as well.", "This game reminded me that there's fun to be had in everything, and it has brought both me and my Son many happy memories."]}}},
{"steamid": "76561198382191549", "description": {"sentiment": "positive", "features": {"immersive world": ["The game's beautiful and expansive world is incredibly immersive and engaging."], "blending of genres": ["The way V Rising seamlessly blends different genres and gameplay mechanics together creates a rich and diverse gaming experience."], "unique premise": ["The game's unique premise of being a vampire who has just risen from the dead and tasked with rebuilding power and creating a new civilization of vampires adds a layer of depth and complexity to the game that kept me engaged and invested in the story."], "graphics and sound design": ["The game's graphics and sound design are top-notch, with stunning visuals that bring the game's world to life and immersive sound effects that help to create a truly immersive experience."]}}},
{"steamid": "76561198045079490", "description": {"sentiment": "unknown", "features": {}}},
{"steamid": "76561197980510831", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198006099565", "description": {"sentiment": "positive", "features": {"early access": ["The game is very good, especially for early access."], "content": ["There's still a good 80-100 hours of content for people who want to play on a PvP server and more for pshyco's like me who want to 100% everything."], "PvE fights": ["There's no truly tough end game PvE fights apart from the shard bosses (and two of them I found pretty easy)."]}}},
{"steamid": "76561198044089661", "description": {"sentiment": "positive", "features": {"combat system": ["The game's combat system is absolutely 10/10."], "enemies": ["The enemies in the game are well-designed and add to the overall experience."], "lore": ["The game's lore is well-developed and adds to the overall immersion of the game."], "ai": ["The AI in the game is very good and makes the fights look like little skirmishes."], "map": ["The game's map is expansive and I've only explored 30% of it so far."], "pvp": ["I enjoyed playing the 2 player PVP mode and it will probably be my go-to mode."], "pve": ["I tried the PVE mode first and it helped me get used to the combat system."]}}},
{"steamid": "76561198041504209", "description": {"sentiment": "positive", "features": {"combat": ["Exceptional game with a modest price tag, good combat, and the survival experience is extremely customizable with numerous settings.", "Excellent survival game with exceptional (MOBA style) combat and vampire mechanics."], "survival experience": ["Exceptional game with a modest price tag, good combat, and the survival experience is extremely customizable with numerous settings."], "customization": ["Exceptional game with a modest price tag, good combat, and the survival experience is extremely customizable with numerous settings."], "bosses": ["Bosses are a main part of the progression and each one feels unique, with the final three being very well designed and having their own unique mechanics/sequences."], "building system": ["The building system initially feels very simple and somewhat restrictive, but after experimenting and toying with it you can achieve some truly beautiful results.", "The pieces that you can build with look great and there are many options to make your castle [i] your [/i] castle."], "progression": ["Progression felt smooth and satisfying throughout the game and only really hit a dull moment when having to grind research materials to gear up to handle the next tier of bosses."], "game settings": ["Whatever personal grievances you might have with the game balance/progression/rules can most likely be addressed in the game settings, of which there are many.", "Things such as resource yield, enable/disable fast traveling with items, enemy health/damage, player health/damage, durability loss, and even starting with different tiers of equipment to quickly get back to whatever point in the progression you'd like."], "price": ["Exceptional game with a modest price tag, good combat, and the survival experience is extremely customizable with numerous settings.", "Very much worth the price and well polished."], "polish": ["Very much worth the price and well polished."]}}},
{"steamid": "76561198019823281", "description": {"sentiment": "positive", "features": {"Graphics": ["The graphics are good."], "Music": ["The music is alright."], "Difficulty": ["The game is hard."], "Bugs": ["There were few bugs that you can use for speedrun."], "Story": ["There is none."], "Gameplay": ["The game is fun and challenging."], "Game time / Length": ["The game is long (40-60 hours) if you complete everything."], "Price / Quality": ["Wait for Sale."]}}},
{"steamid": "76561197986375076", "description": {"sentiment": "positive", "features": {"vampire theme": ["The cool vampire theme adds an interesting twist to the survival/base building genre."], "graphics & atmosphere": ["The graphics and atmosphere are really nice and immersive."]}}},
{"steamid": "76561198024882978", "description": {"sentiment": null, "features": {}}},
{"steamid": "76561197976313504", "description": {"sentiment": "positive", "features": {"boss fights": ["The game has a lot of bosses. A lot. Valheim has 6 bosses, I think V Rising has about 60. They all feel great to fight.", "all or almost all of them feel extremely satisfying to fight."], "gear progression": ["Progression is largely through your gear. There's no XP, there's \"gear level\" which determines your character's level. Different gear has different stats - usually health, abilitiy cooldowns, physical or spell power, critical chance.", "Defense is not one of those stats at all in the game, so I am a little surprised that the devs have managed to balance the levels and enemies as well as they have.", "You'll be unlocking recipes and powers from killing bosses - and that's the core of the game."], "base building": ["The building in the game does not have the customisation that Valheim has, but with the top-down aspect, that isn't a bad thing at all and for what the game is, I feel it actually improves it by having less customisation.", "As you progress, your castle will grow and you won't want to do a whole lot of Valheim-level customisation anyway - you just want room for your storage and your machines, and the layout takes a bit of a backseat and the game is better for it.", "The game has base building but I wouldn't call this a base building game."], "vampire tropes": ["Obviously, you're a vampire, and all the tropes are here. Garlic exposure makes you take more damage. Holy radiation actively damages you. The longer you carry silver coins, the more damage you'll take while you don't have the necessary resistance. Feeding on different kinds of targets gives you different kinds of bonuses. Not feeding will eventually start to kill you. Trying to avoid the sunlight adds another dimension to everything you do in this game - the worst thing you'll do in this game is be fighting a boss, the sun comes up, and that boss starts accidentally destroying the trees that provide you with the shadows you need to stand in."]}}},
{"steamid": "76561198017222041", "description": {"sentiment": "positive", "features": {"Change of Scenery": ["The change of scenery adds a new and exciting element to the survival game."]}}},
{"steamid": "76561198322161250", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198024251554", "description": {"sentiment": "positive", "features": {"combat mechanics": ["smooth and satisfying"], "castle building": ["thoroughly detailed"], "resource management": ["thoroughly detailed", "not over complicated"]}}},
{"steamid": "76561198006006240", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198325290457", "description": {"sentiment": "positive", "features": {"survival experience": ["The game provides a great survival experience with friends."], "vampire theme": ["The vampire theme is unique and interesting."], "gameplay style": ["The game has a hack-n-slash gameplay style similar to Diablo."], "polished": ["The game is well-ish polished."]}}},
{"steamid": "76561197990586998", "description": {"sentiment": "unknown", "features": {}}},
{"steamid": "76561198038936530", "description": {"sentiment": "positive", "features": {"open world": ["one of the best open world survival game I've played"], "combat": ["Combat feels visceral and fluid"], "building": ["Building, crafting & progression has a great foundation"], "gear variety": ["I'd love to see more gear than just 1 set per tier for increased build variety"], "cosmetic rewards": ["cosmetic rewards that persist across your characters"]}}},
{"steamid": "76561197988838487", "description": {"sentiment": "positive", "features": {"gathering and crafting": ["unlike other survival games it doesn't put the focus on the dull repetitive tree punching"], "hunting": ["this little gem has you hunting your prey"], "exploring": ["this little gem has you...exploring"], "building": ["this little gem has you...building"], "new recipes": ["discovering new recipes from the get go"], "avoiding the sun": ["the dynamic of avoiding the sun is cleverly used and will help you survive summers in Oregon... Oh wait Transilvania"]}}},
{"steamid": "76561198015372551", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198037120810", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561198209219955", "description": {"sentiment": "positive", "features": {"survival game": ["great for first timers and expert players", "even greater with a friend"]}}},
{"steamid": "76561198042258110", "description": {"sentiment": "positive", "features": {"vampire lore": ["V Rising truly captures the essence of traditional vampire lore", "its depiction of the player's insatiable thirst for blood and the ability to shape-shift and dominate other creatures"], "gothic-inspired visuals": ["The game's gothic-inspired visuals, haunting soundtrack, and immersive atmosphere combine seamlessly to create a truly authentic vampire experience"], "immersive atmosphere": ["The game's gothic-inspired visuals, haunting soundtrack, and immersive atmosphere combine seamlessly to create a truly authentic vampire experience"], "fun gameplay": ["it's an incredibly fun game to play", "it's super easy to get into", "it's addictive as hell"]}}},
{"steamid": "76561198039196255", "description": {"sentiment": "positive", "features": {"journal": ["The journal is very helpful at getting a sense of direction, which is often missing from these survival style games."], "setting": ["The setting is very fun"], "music": ["The music enhances the mood"], "combat": ["Learning the ebbs and flows of combat have been thrilling."]}}},
{"steamid": "76561198068347948", "description": {"sentiment": "positive", "features": {"bosses": ["I love that the bosses aren't push overs"], "building and crafting": ["the building and crafting in the game is super in depth"], "vampire mechanics": ["I love how it really makes you feel like the traditional vampire", "Sun burns, garlic de-buffs, (i haven't seen any crosses yet) and you actually use a mirror to adjust your character", "I love the way you can enslave humans, or make them prisoners to feed off of them"], "early access": ["This game is definitely a must, and I normally stay away from Early Access games. Stunlock did their customers right with this one."]}}},
{"steamid": "76561198850330118", "description": {"sentiment": "neutral", "features": {}}},
{"steamid": "76561199020776710", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561198008230834", "description": {"sentiment": "positive", "features": {"bosses": ["the game has more bosses than Valheim"], "unique enemies": ["the game has unique enemies"], "variety in abilities": ["the game has a lot more variety in abilities"], "build system": ["the build system is really nice"], "variety in games like Conan Exiles": ["the game has less variety than games like Conan Exiles"]}}},
{"steamid": "76561198049724653", "description": {"sentiment": "positive", "features": {"Gorgeous graphics": ["Simply a gorgeous game"], "New game mechanics": ["A tank spec working in pvp/pve to reduce damage maybe at cost of some of your own dps", "implement 'friendly' duels and/or make the Arena a neutral land where you cant attack until you engage a duel", "Add a really short, weekly, instance dungeons/Raids using the siege mechanics too", "add the option to move your castle saving all the mats and servants in our heart castles for X time", "make more monsters to use in our dark castle to add variety and make the encounters/sieging more fun for both attackers and defenders"], "New features for mounts": ["Add some stable to our castle to save lock the horse you found", "This is an opportunity to add aesthetics things to customize our mount (different colors / skeletal/ daemonic / horns , wings etc)"], "New PvP features": ["Add istanced battlegrounds like in wow (catch the flags, king of the hill, and castle sieging as attacker and defenders) to do practice, trying build and having fun without consequence", "Add a buff spending a ridiculously huge amount of essence to 'freeze' your castle from decaying until you log in back (make a cap idk like 1 month). Until that time the castle is locked, for your party member too, but still raidable in pvp."], "New rewards and events": ["maybe adding some events like a fat pve boss to kill/Arena tournaments with aesthetic gear/decorations or point to spend in transmog as a reward", "that give some lesser but fun rewards maybe with weekly quest to broke monotony of the end game for pvp and pve"]}}},
{"steamid": "76561198010896099", "description": {"sentiment": "positive", "features": {"ARPG with build and style variety": ["The game has a perfect mixture of an ARPG with some build and style variety thanks to spells and weapon combinations."], "Survival and base building game": ["The game combines with a survival and base building game like Rust for example."], "Bosses unlocking spells, recipes, refineries, and crafting tables": ["You get stronger by killing bosses which unlock either spells, recipee for better weapons or important refineries or chafting tables for castle which is also a fenomenal system."], "Castle building system": ["The castle building system is very fun to build, very easy to understand and with your imagination as the limit of how to do it."], "PvP and multiplayer aspect": ["So far PvP and the multiplayer aspect has been very fun with some lil rivalries and allying with neighboors etc.", "The Voice chat really adds to that experience (when it works)."], "Content": ["For a game in early acces I at least find already a package full of content (20 hours and still much to do, would say Im less than half way trough everything and discovering end game)."], "Vampire mythos and fantasies": ["An ideal game if you love vampire and their mythos and fantasies."], "Playing with friends": ["Great game to play with friend and rule over tha land form your gothic neatly crafter castle."]}}},
{"steamid": "76561198003695268", "description": {"sentiment": "positive", "features": {"visuals": ["The game is visually stunning"], "controls": ["The game controls exactly like Battlerite"], "experience": ["The overall experience is great so far"]}}},
{"steamid": "76561198064393584", "description": {"sentiment": "positive", "features": {"aesthetically stunning game": ["The game's graphics are beautiful and immersive."], "mix of game play mechanics": ["The game offers a good mix of game play mechanics."], "immersive environments/ biomes": ["The game's environments are immersive and varied."], "in depth crafting options": ["The crafting system is detailed and offers a lot of options."], "day and night cycle": ["The day and night cycle adds to the game's immersion."], "PVP server": ["The PVP aspect of the game adds an extra layer of challenge and excitement."], "potential": ["The game has a lot of potential for future updates and content."], "easy to pick up and learn": ["The game is easy to learn and get started with."], "difficult to master": ["The game offers a good challenge and is difficult to master."]}}},
{"steamid": "76561198002678595", "description": {"sentiment": "positive", "features": {"Gameplay": ["The gameplay is smooth."], "Server customization": ["You can edit your private server or dedicated server to your liking with a ton of modifiers."], "Character customization": ["You look weird in the beginning but as you get outfits you start looking better."], "World immersion": ["World feels alive, patrols on the road, predator animals hunting prey animals.", "Shadows dynamically moving so you need to adjust how you hide in shade."], "Game flow": ["The game flow is pretty smooth. If you have a question about how to make something, more than likely a part of the boss rewards."]}}},
{"steamid": "76561198044254564", "description": {"sentiment": "positive", "features": {"gameplay": ["It's like Valheim and Albion Online had a baby and that baby got bit by a vampire."]}}},
{"steamid": "76561198006924194", "description": {"sentiment": "positive", "features": {"vampire atmosphere": ["The vampire atmosphere all the time make this game a really unique one."], "dynamic gameplay": ["Compared to Valheim for example, it's more dynamic and more funny to play."], "lots of things to do": ["There are lots of things to do!"], "solid vampire survival game": ["After +24h of gameplay, I can say that this is a very solid vampire survival game."], "fun to kill": ["Fun to kill."], "fun to build": ["Fun to build."]}}},
{"steamid": "76561198009877171", "description": {"sentiment": "neutral", "features": {}}},
{"steamid": "76561198012020900", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561198005400020", "description": {"sentiment": "positive", "features": {"polished gameplay": ["For an Early Access game, this is even more polished than Valheim which I found pretty awesome as well."], "challenging enemies": ["all the V bloods are challenging", "get easier depending what order you kill them in as the previous V Blood could have an ability that helps you greatly in defeating another V Blood."], "crafting and abilities": ["I need the Bandit King to progress to learn to craft iron bars, tailoring table and learn some new kill/abilities."]}}},
{"steamid": "76561198047039446", "description": {"sentiment": "neutral", "features": {}}},
{"steamid": "76561198210184547", "description": {"sentiment": "unknown", "features": {}}},
{"steamid": "76561198077808520", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561197967300964", "description": {"sentiment": "positive", "features": {"server": ["You can run your own server to play with friends and avoid the unpredictability of public servers."], "solo play": ["Manipulating server settings for solo play is highly recommended.", "Teleporting with items is possible with server settings manipulation."], "future expansion": ["The game has a lot of groundwork for future expansion.", "The system is very well implemented now.", "The developers seem to be very focused and have done a lot of the foundational work ahead of time."], "unique gameplay": ["There's no other game like this yet.", "Valheim has 4 or 5 bosses. This has like 40. Big difference."]}}},
{"steamid": "76561198064662122", "description": {"sentiment": "positive", "features": {"bug-free gameplay": ["After 5h, I have not encountered even one bug, which to me speaks volumes, since this is an early access and frankly, I did expect the game to be unplayable. This has been a very pleasant surprise on this front."], "fun gameplay with others": ["This is the kind of game that is definitely best played with others, as going solo can become tedious veru quickly."], "potential": ["Game has potential and it is not bad for early access."]}}},
{"steamid": "76561198166465907", "description": {"sentiment": "positive", "features": {"combat system": ["The combat feels clean and very smooth", "The interactions with abilities and combo potential feel natural and fluid", "The depth of the combat has an incredibly high skill ceiling", "The combat system is rich and complex enough to offer anyone a challenge"], "day/night cycle": ["The day/night cycle is a nice addition to an open world survival game", "The sun placement keeps the player on their toes and aware of the time", "The sun can impact combat in both a fun and sometimes frustrating way", "The addition of the sun ultimately makes the game more fun"], "blood system": ["The blood system is a unique component that I really enjoyed", "The different types of blood grant the player different advantages", "The sense of rarity to 100% blood of any type adds an element of excitement and urgency", "The blood system blends very well with the rest of the game, adding another seamless level of complexity"], "boss design": ["The boss design overall is great", "Most bosses feel absolutely unique and engaging", "The environments that the bosses are in are often quite interesting and allow the player to utilize them to gain an advantage over the boss", "Some bosses could use AI improvement and see a cutback on their ad spawning"], "world/area design": ["The entire world immerses you quite well", "There are tons of scenic vistas you'll be able to appreciate", "The 4 zones all have really great differences and are large enough for the player to explore for hours", "Every item is important in some way or another, so material grinding never feels pointless"], "abilities/weapons": ["V Rising offers a large list of unique abilities that are interchangeable with one another", "The weapons in V Rising can best be described as simple, allowing for non-experienced and experienced players alike to enjoy and learn the weapons without feeling overwhelmed", "The abilities themselves are cool and unique", "All of the weapons fair well in both PvP and PvE environments"]}}},
{"steamid": "76561198002798580", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561199209611968", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198098019553", "description": {"sentiment": "positive", "features": {"Valheim and Diablo hybrid": ["The game has a great mix of elements from both Valheim and Diablo, which makes it unique and enjoyable."], "Early access game": ["The game is surprisingly really good for an early access game."], "PVE aspects with friends": ["Finally a game with no need for extreme PVP and can actually enjoy the PVE aspects with friends."]}}},
{"steamid": "76561197989933081", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561197973079155", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198257798738", "description": {"sentiment": "positive", "features": {"combat": ["The combat is the biggest draw of the game.", "Progression in the game is done through gear and V blood powers.", "Even with low tier gear, skilled players can fight and defeat higher level bosses.", "The blood types act as a class system with different passive bonuses.", "There are different skills that can be mixed and matched like in an RPG.", "Fighting during the day adds a sense of danger and excitement to the game.", "You have to plan your hunts or risk becoming the hunted."], "survival building": ["The survival building aspect is pretty simple.", "Structures can't be uniquely designed, but everything snaps into place as long as you have the resources and build within your own borders."], "PVP": ["The combat is good, so PVP is likely to be enjoyable.", "Players can host their own private servers to play alone or with friends."], "fps issues": ["There were some fps issues in the beginning of the game, but overall it is pretty fun."], "game development": ["Looking forward to seeing how the devs develop this game further."]}}},
{"steamid": "76561198000473846", "description": {"sentiment": "positive", "features": {"game experience": ["The game experience is almost like valheim"], "bugs": ["It doesn't have noticeable bugs"]}}},
{"steamid": "76561197978962100", "description": {"sentiment": "positive", "features": {"well polished": ["The game is well polished, which makes the gameplay experience smooth and enjoyable."], "dedicated servers": ["The fact that the game has dedicated servers supported at release is a big plus, as it ensures a stable and reliable online experience."], "tons of content": ["The game offers a lot of content, which provides a lot of replay value and keeps the game interesting and engaging."], "priced perfectly": ["The game is priced perfectly, which makes it accessible to a wider audience and provides good value for money."]}}},
{"steamid": "76561198325331255", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198384298709", "description": {"sentiment": "positive", "features": {"PVE difficulty": ["This has become one of my favorite games of all time. Its the perfect PVE difficulty"], "unique bosses": ["each boss is very unique and very fun to fight"], "gear progression": ["The gear progression is linear as it is only 1 set per level"], "additional gear sets": ["Would be very cool to add more sets that have different effects like the necklaces do near the end of the game"], "fun with friends": ["All in all i highly recommend this game especially if you and a few friends are looking to clown around as vampires and maybe meet a few new friends"]}}},
{"steamid": "76561198116415679", "description": {"sentiment": "positive", "features": {"building system": ["Very good building system"], "progression": ["exciting progression"], "combat": ["nice combat"]}}},
{"steamid": "76561198093990701", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561198094649547", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198368032841", "description": {"sentiment": "positive", "features": {"crafting": ["The crafting system was really enjoyable and added a lot of depth to the game."], "exploration": ["Exploring the game world was a lot of fun and there was always something new to discover."], "bosses": ["The boss battles were challenging and rewarding."], "magic": ["The magic system was well-designed and made playing as a mage really fun."]}}},
{"steamid": "76561198079309106", "description": {"sentiment": "positive", "features": {"content": ["For being an Early Access title it do have a lot of content"], "bugs": ["without any noticeable bugs"]}}},
{"steamid": "76561198117019545", "description": {"sentiment": "positive", "features": {"building": ["I have always appreciated building games and Vampire games, but never thought they would come together so well.", "I would highly recommend this game, for anyone looking for a building fix, but don't want to miss out on the fun of hunting down your prey."], "gameplay": ["There is always something for you to do, even the grind for some items/supplies is super fun and engaging.", "Getting servants and the different blood types is not too simple, but not so complicated that you struggle.", "There are so many aspects of the game that help add up to how wonderful and interactive this game is.", "You are never the strongest creature on the map, there is always someone stronger, or you can get killed from not paying attention in a fight, therefore the game keeps you on your toes a little bit and keeps you thinking of new ways to approach situations."]}}},
{"steamid": "76561198184843841", "description": {"sentiment": "positive", "features": {"gameplay": ["Challenging gameplay"], "graphics": ["Cool graphics"]}}},
{"steamid": "76561198008822977", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198085984689", "description": {"sentiment": "positive", "features": {"combat": ["Similar in combat to Diablo"], "crafting systems": ["Really shines in its Valheim esk crafting systems and building that go extremely deep"], "bosses": ["50+ Bosses that Unlock skills that keep you challenged into endgame"], "human slavery system": ["A human Slavery system"], "blood buffs": ["Different buffs for drinking certain blood that get stronger with quality so hunting for the greatest quality bloods is a fun endeavour"], "progression items": ["More progression items than a Zelda game with coop and pvp and just... so much game"]}}},
{"steamid": "76561198059370017", "description": {"sentiment": "positive", "features": {"smooth controls": ["Game is very smooth (controls)"], "amazing atmosphere": ["Atmosphere is amazing"], "amazing sound design": ["sound design is amazing"], "engaging time sinks": ["There are many time sinks built in game which I don't mind since they are made for keeping players engaged and more excited about getting new gear, weapons etc."], "low price": ["this game is one of the best Early Access game to launch and at a very low price of 20$."]}}},
{"steamid": "76561198160527294", "description": {"sentiment": "neutral", "features": {}}},
{"steamid": "76561197962626149", "description": {"sentiment": "positive", "features": {"character customization": ["The character creator is pretty decent and features enough options to actually allow for some pretty unique visual appearances.", "You can easily make something that looks similar to a human, or a night elf, or even a ghoul, and a few others.", "Overall it is a pretty good creator with a fair amount of options, especially for early access."]}}},
{"steamid": "76561197960790214", "description": {"sentiment": "positive", "features": {"game loop": ["Tighter game loop than Valheim with more fun combat"], "elements": ["A lot of the elements that make Rust fun and addictive"]}}},
{"steamid": "76561197995040751", "description": {"sentiment": "positive", "features": {"gameplay loop": ["Very addictive gameplay loop"], "polished": ["surprisingly polished for Early Access"], "abilities": ["the abilities are really fun"], "crafting": ["the crafting isn't as grueling as some others"]}}},
{"steamid": "76561198006565460", "description": {"sentiment": "positive", "features": {"robust Early Access launch": ["The game was surprisingly stable and well-functioning despite being in Early Access."], "affordability": ["The game is very affordable considering everything it offers."], "progression system": ["The game's progression system was initially confusing but became more understandable after a few hours of play."], "beginner-friendly resources": ["The game has a lot of beginner-friendly resources available, such as streams, YouTube videos, and starter tips."]}}},
{"steamid": "76561198012435183", "description": {"sentiment": "positive", "features": {"gameplay": ["good Dungeon keeper vibes"], "recommendation": ["Totally recommended right now"]}}},
{"steamid": "76561198128363815", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198835979510", "description": {"sentiment": "positive", "features": {"mouse lock option": ["The addition of the option to lock the mouse on to the game is fantastic.", "This feature is seriously worth the money for this game."], "PVE survival": ["If you love PVE survival, this game is especially worth it."]}}},
{"steamid": "76561197996808430", "description": {"sentiment": "positive", "features": {"content": ["The update added a huge amount of content."], "performance": ["The update fixed performance issues."], "PVE": ["The PVE aspect of the game is keeping me happy."]}}},
{"steamid": "76561198041990369", "description": {"sentiment": "positive", "features": {"Gameplay": ["The combat is Simple and Rewarding with many skills to choose from to build your Ideal vampire", "Aswell as having a Focus on gear-score instead of levels make progressing feel like 'do at your own pace' sort of system which also ties into difficulty the game simply is only as hard as you make it since you can gear up before bosses or go in much lower than the bosses recommended gearscore.", "The Thrall system is very fun and rewarding as it helps you farm for rare mats 'materials' or for mats that you deem to annoying to farm yourself.", "Base building is one of my favorite things in this since you make your own dwelling in a wide variety of locations"], "Graphics": ["Game is very-very well made for being released in (EA) 'Early Access' as-well as being priced at $20.", "The blood management system is pretty decent and easy to keep up on"], "Storyline": ["This is hands down my Favorite (Survival ARPG) of 2022", "Feels like a Classic ARPG, Similar to games such as Diablo or Neverwinter."], "Sound": ["None"], "Characters": ["None"]}}},
{"steamid": "76561198051643248", "description": {"sentiment": "positive", "features": {"game runs great on modern hardware": ["The game runs smoothly and without any issues on modern hardware."], "fun survival/crafting game": ["The game is one of the most fun survival/crafting games the customer has played."], "would highly recommend": ["The customer highly recommends the game to anyone who enjoys the genre."]}}},
{"steamid": "76561198101167477", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561198056171281", "description": {"sentiment": "positive", "features": {"Atmosphere": ["The atmosphere of the game is captivating and immersive."], "Music": ["The music in the game is enjoyable and adds to the overall experience."], "Mechanics": ["The game mechanics are easy to learn and understand.", "The different blood types make the game unique and interesting.", "The base building is simple and player-friendly, allowing for easy refunds of resources.", "The PvP and PvE combat is rewarding and fun, with a variety of weapons and abilities to choose from.", "The game captures the audience well and provides a good performance without any bugs or loading screen issues."], "Quests": ["The quests and boss rewards are shared within a group, so nobody loses anything if you don't \"feed\" on the defeated boss."], "Bosses": ["There are more than 35 bosses to track down in the game."], "Map": ["The game has a huge map with plenty of encampments to pillage and plunder."]}}},
{"steamid": "76561198123194221", "description": {"sentiment": "neutral", "features": {}}},
{"steamid": "76561198236461558", "description": {"sentiment": "positive", "features": {"combat": ["The combat is very technical and utterly merciless."], "challenge": ["If you liked Valheim but wanted more challenge and overall sweat then this is for you."], "performance": ["Performance-wise it's okay, my rig is nothing special and it runs fine on high settings, with the occasional stutter here and there."]}}},
{"steamid": "76561198004005572", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561197979125205", "description": {"sentiment": "positive", "features": {"Duo clan servers": ["You can create a clan with a max of only two players."], "Combat": ["Combat is very deep.", "As you kill monsters in the game you gain more skills.", "You can then select any of those skills to use."], "Castle building": ["Castle building is very detail, lots of cool items to place in your castle."], "Crafting": ["Tons of crafting machines to convert one item to the next.", "Tons of stuff to gather in this game."], "Mounts and transportation": ["There are mounts, but you can also turn into certain creatures to run faster.", "You can also teleport places using the waypoints.", "As you discover things with the map, it will show the important loot in that area."], "Servant gameplay mechanics": ["The servant game play mechanics are super cool, you can capture enemy humans to make them do things for you and come back with loot.", "This is a timed thing which could take up to like 20 hours."], "Ingame VOIP and clan chat": ["Ingame VOIP works perfectly well.", "There is ingame clan chat for people that are not using a microphone or a VOIP program."], "Vampire scene and blood mechanics": ["The whole game is just super well design.", "Having to skip in the shadows like an actual vampire is just different.", "Taking other animals blood to increase passive stats is another awesome thing.", "Some enemies will give you a passive 'creature' or 'warrior' buff and they both do different things.", "Finding the right buff for your build is neat."]}}},
{"steamid": "76561198219353528", "description": {"sentiment": "positive", "features": {"female models": ["+rep for the female models"], "game progression": ["Fun game progression"], "combat": ["combat is smooth"], "building mechanics": ["building mechanics are quite entertaining"]}}},
{"steamid": "76561199078583914", "description": {"sentiment": "neutral", "features": {}}},
{"steamid": "76561198052974531", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198065343430", "description": {"sentiment": "positive", "features": {"combat": ["The combat is interesting, and not fully the bullet-hell you'd think it'd be.", "bosses have a moveset that you'll need to learn and weave around"], "progression": ["the progression can still be felt", "The game does a decent job of keeping you moving forward"], "catchup mechanic": ["there's an actual setting that let's you start in various tiered gear, including bosses slain for their recipes and powers", "It's been very helpful as a general 'catchup' mechanic"], "updates": ["I hope they're vigilant in keeping up with adding map zones, crafting recipes, and gear", "I hope V Rising stays competitive by keeping the updates consistent"]}}},
{"steamid": "76561198247899418", "description": {"sentiment": "unknown", "features": {}}},
{"steamid": "76561198052399320", "description": {"sentiment": "positive", "features": {"mechanics": ["The combat especially stands out as top notch, taking a neat direction with the already praised battlerite combat and giving it a vampiric and magical spin.", "Each boss has a cool fight with neat unique mechanics backing them up."], "map": ["The map's curated nature fits well with the ideas in the game, much like Ark and Conan's maps are."], "roleplaying": ["You get to roleplay as a mf-ing vampire."], "polish": ["Third person survival sandbox vampire rpg with polish and killer combat."]}}},
{"steamid": "76561198056392718", "description": {"sentiment": "neutral", "features": {}}},
{"steamid": "76561197984497397", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561197968207989", "description": {"sentiment": "positive", "features": {"early access title": ["For an early access title, this one is far far FAR better off than most early access titles I've ever played."], "survival mechanics": ["The 'survival' mechanics are very light, only needing to feed on blood every so often its rarely been an issue.", "Other than that there isn't much else survival wise."], "various builds": ["There are various builds you can make, various weapons and weapon types that as you get the upgraded versions begin to offer their own individual weapon skills that can dramatically alter how you want to approach a situation."], "bosses": ["There are many bosses located around the map and it encourages you to go after each one to unlock some new crafting options or decorative options and gives you a way to track down specific bosses making it easier to find the ones you need."], "PvP": ["The PvP, it feels pretty tight, the hit registration appears to be spot on and a good 4v4 fight where everyone is of equal level it can be quite the brawl and its FUN when it happens.", "I personally play on a normal PvP server, you only drop your inventory when you die and not your entire Kit, which to me personally encourages me to actually go out there and fight people instead of being too concerned about just losing everything."], "base building": ["Its very limited, you won't see player buildings in this game like you would Ark, what it makes up for with its simplicity is its diversity.", "You can make some rather sizable bases as you slow expand your land claim and you can set them up however you wish with the grid system.", "It encourages to have an actual layout with some thought put into it because the various crafting stations will perform better if placed in a full room with the correct type of flooring.", "There are many many little decorations you can throw up pretty much anywhere you want to give it at least a bit of the customization you want."], "foundation": ["But is the game good? It still needs some love but they have an absolutely rock solid foundation here and for an early access game thats pretty impressive."]}}},
{"steamid": "76561198054597732", "description": {"sentiment": "positive", "features": {"castle building mechanics": ["Just complex enough to give you a lot of options but simple enough to be fun"], "combat": ["Great"], "RPG mechanics": ["Really interesting", "A lot of options", "You can be anything from vampire mage to a warrior or archer and anything in-between"]}}},
{"steamid": "76561198160823461", "description": {"sentiment": "neutral", "features": {}}},
{"steamid": "76561198000446833", "description": {"sentiment": "positive", "features": {"QOL improvements": ["The game does all the QOL things I have wished others in the genre would do."], "theme": ["The theme works so well."], "vampires": ["Love me some vampires."], "player as monster": ["Love that the game actually makes you a monster."]}}},
{"steamid": "76561198392632684", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198018569528", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198823022667", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198061237244", "description": {"sentiment": "positive", "features": {"Combat": ["Combat is tight"], "Players as end game bosses": ["players are the real end game bosses"]}}},
{"steamid": "76561198006721296", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198101233182", "description": {"sentiment": "positive", "features": {"Vampire atmosphere": ["The Vampire atmosphere is back in fashion, and that's good!"], "Gameplay": ["V Rising has consistent combat mechanics, much like a Diablo, with survival and crafting.", "There are in fact many paths to choose from, but without a doubt, the best way to take full advantage of this title is the PVP aspect, create a clan and always have your heart in your hands for fear that another clan will attack you.", "Even about the storage, this title allows you to click on just one button to organize all the material, from the same source, already present in the box. Small aspects that make it easier in the long run and that make V Rising a really fun title."], "Graphics": ["The graphics are another very eye-catching aspect. From the highly populated villages, through the somehow frightening forests, or even the cemeteries with their fog aura that hides dozens of enemies. Even during action and combat, all the effects produced by the attacks are hats off."], "Blood system": ["It's really interesting to understand what you want to do next and capture the specific blood type for that activity.", "This blood bar works a bit like a food bar and if it reaches 0, the player will start taking damage. It is also one of the ways to recover health, so it is possible to consume the blood to recover the bar that affects life."], "Bosses": ["there is the possibility of killing Bosses that give the player their powers and even recipes for new equipment or objects.", "There are really a lot of bosses and all of them have different types of attacks"], "Construction": ["Whether the player wants to be a \"Honey I Changed the House\", or just wants to do the bare minimum to have a fully functional Dracula mansion. the construction is quite simple, intuitive, and captivating."]}}},
{"steamid": "76561197987969677", "description": {"sentiment": "positive", "features": {"progression": ["Progression mostly involves killing bosses - some of them are quite hard, but nothing that you can't solo (at least that was my experience). By killing them you unlock new stuff to craft/build and new powers - from which you can pick the ones that you want to use in a fight, you have three slots for them, and you can just switch them on the fly."], "combat": ["The combat feels very smooth and nice (but no wonder, they just got it from their other game, so if you also played Battlerite it feels the same here).", "There are also different weapons and all of them have their unique weapon skills."], "abilities": ["You also get some more out of fight abilities like different animals forms to traverse the land or the skill to lure humans to your castle to make servants or prisoners."], "world": ["The world feels alive, you can stumble across skeletons fighting humans, stone golems fighting animals or even bosses fighting each other, which is a very nice touch."], "customization": ["Building the castle is a little restricted by isometric view, but still you have a lot of options to decorate, and you can even have a nice garden with graveyard.", "When you set up your own private game, you have a lot of options to optimize it for your needs."], "gameplay": ["The game can get a little grindy at times, but I think it's the case with almost every survival game, but! Playing over 30h now, I still didn't get bored because there is just so much to do in this game!", "There are teleports over the map, but by default you can't teleport with materials - you can change that in server options.", "Besides that, there is also a cave system that you can get around the map more quickly with materials if you play on the server with default settings."]}}},
{"steamid": "76561198128010476", "description": {"sentiment": "positive", "features": {"fleshed out": ["This game is really fleshed out for being in early access"]}}},
{"steamid": "76561198112591484", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561197987718807", "description": {"sentiment": "positive", "features": {"hardcore pvp server": ["Enjoyed playing on the hardcore pvp server"], "reminds me of Ultima Online": ["Reminded me of the classic game Ultima Online"], "Same view as UO": ["Appreciated the similar view to Ultima Online"]}}},
{"steamid": "76561198072311547", "description": {"sentiment": "positive", "features": {"sprint": ["The customer would like to have a way to sprint in the game to get around the map faster."], "recipes": ["The customer suggests tweaking the recipes to make them easier in the early game."], "fast travel": ["The customer would like to be able to fast travel with resources."], "thrall convert times": ["The customer suggests lowering the thrall convert times as they feel it takes too long."], "fun gameplay": ["The customer was surprised by how fun the game is."]}}},
{"steamid": "76561197991074829", "description": {"sentiment": "positive", "features": {"smooth gameplay": ["The game is smooth and I haven't come across a single bug."], "lots of content": ["There is so much content."], "unique combination of games": ["Best way to describe it is if Albion, Rust, Diablo and Valheim had a foursome and created a Demonic Vampire baby."]}}},
{"steamid": "76561198017436638", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198015337264", "description": {"sentiment": "positive", "features": {"Action RPG": ["I enjoyed the gameplay style similar to Diablo or Torchlight"], "Crafting elements": ["I liked the addition of crafting elements"], "Vampire theme": ["I enjoyed the vampire theme of the game"]}}},
{"steamid": "76561198118195679", "description": {"sentiment": "positive", "features": {"combat": ["looks a lot like Diablo", "feels exactly like Battlerite", "feels cleaner than Lost Ark PVP"], "potential": ["Lot of potential", "I will enjoy my time throughout Early Access, no doubt"], "content": ["a year of patches will bring a lot needed content where the game lacks in its exploration phases"], "singleplayer PVE experience": ["highly advise you buy it and enjoy the 60+ hours of content it has, even as a singleplayer PVE experience"]}}},
{"steamid": "76561198138390090", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198972040042", "description": {"sentiment": "unknown", "features": {}}},
{"steamid": "76561198094839543", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198110675606", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198018367507", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198053948951", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561198096444435", "description": {"sentiment": "positive", "features": {"PVP": ["The PVP is great"], "progression curve": ["The progression curve is fun enough to keep you going for hours and hours on end."]}}},
{"steamid": "76561198022488863", "description": {"sentiment": "positive", "features": {"combat": ["If you like the Battlerite combat paired with a great PvE bosses"], "base building": ["building an epic base"]}}},
{"steamid": "76561198893265313", "description": {"sentiment": "positive", "features": {"controls": ["It took me a little while to learn the controls but after I did, this is a really fun game to play."], "multiplayer": ["I recommend this game especially if you play with a friend, great fun."], "map expansions": ["Looking forward to map expansions plus new bosses."]}}},
{"steamid": "76561198426153397", "description": {"sentiment": "positive", "features": {"jumping": ["I wish we could jump up cliff sides"], "everything else": ["Grade A great job Devs!!!"]}}},
{"steamid": "76561198104171526", "description": {"sentiment": "positive", "features": {"gothic open world": ["A unique and immersive game world that sets it apart from other survival crafting games."], "wildlife and monsters": ["Adds an extra layer of challenge and excitement to the game."]}}},
{"steamid": "76561198000609273", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561197999921251", "description": {"sentiment": "positive", "features": {"combat": ["combat is king", "the bossfights feel substantial and their complexity/difficulty scales exponentially"], "gameplay loop": ["the upgrade/gameplay loop is satisfying"], "atmosphere": ["the atmosphere is grim but beautiful and immersive"], "craftsmanship": ["the game is thoughtfully crafted"]}}},
{"steamid": "76561197970638103", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198013247293", "description": {"sentiment": "unknown", "features": {}}},
{"steamid": "76561198066239118", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198014942884", "description": {"sentiment": "positive", "features": {"tipos de sangres": ["El juego cuenta con diferentes tipos de sangre que otorgan diferentes beneficios al jugador."], "coop": ["El juego cuenta con modo cooperativo para jugar con amigos."], "servidores PVP": ["El juego cuenta con servidores PVP con clanes para diferentes cantidades de jugadores, desde solo hasta 100 personas."], "creación de servidor": ["El juego permite crear un servidor para jugar con amigos."], "universo de Dracula": ["El juego se desarrolla en el universo de Dracula."]}}},
{"steamid": "76561198005291988", "description": {"sentiment": "positive", "features": {"developer": ["it’s incredibly important to have a developer who actually shows they give a shit not only about the quality of their product, but about their customers."], "expansion": ["A true EXPANSION OF THE GAME, not a DLC, not new content at a price, no, it was updated maps, updated weapons, an overhaul of systems under the hood, an entirely new method of building castles, a whole new string of bosses and a whole new area of the world, and it would cost us all… Nothing!", "A free expansion of much needed Quality of Life updates alongside amazing new additions to the game play and aesthetic designs of the game.", "It’s an S-Tier expansion with the devs being johnny on the spot whenever we players found bugs or issues."], "dev team": ["I cannot express how wonderful it is to have a dev team that’s response, cares about their player base, and was willing to take as much time as they needed to deliver an top notch expansion update to their game with as few bugs on release as humanly possible."], "gameplay": ["eating up over 100 hours of my time", "amazing new additions to the game play"], "price": ["buying a quality game at a reasonable price"]}}},
{"steamid": "76561198091560259", "description": {"sentiment": "unknown", "features": {}}},
{"steamid": "76561198020571124", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198060465581", "description": {"sentiment": "positive", "features": {"potential": ["V Rising is a great game with a massive potential to be something amazing if the developers stick at it"], "lore-friendly mechanic": ["Being in the sunlight burns and can kill you, As so you must move In and out the shade or simply only go out at night. Yes, the mechanic can be annoying but leaving a negative review for a Lore friendly mechanic that adds great difficult to the game just because it’s to hard for you? That warrants a negative review?"], "hardcore survival game": ["This game is not for players that pick the “easy option” in games. It’s a hardcore survival game that supports PVP OR PVE."], "early access": ["It’s an early access game and people need to remember early access is not final and is subject to change, most game developers use early access for player feedback not for people to moan like a bitch because they can’t force everyone to sleep in the game."]}}},
{"steamid": "76561198023579729", "description": {"sentiment": "positive", "features": {"combat": ["The combat is enjoyable and reminds me of Valheim."], "resource gathering": ["The resource gathering is also enjoyable and reminds me of Valheim."], "potential": ["The game has a lot of potential."]}}},
{"steamid": "76561197970640457", "description": {"sentiment": "positive", "features": {"progression": ["Interesting take on progression with being focused on killing bosses"], "combat": ["Challenging combat"], "world exploration": ["A very interesting world to explore"]}}},
{"steamid": "76561198083890768", "description": {"sentiment": "positive", "features": {"details": ["I love the details of this game and small details like , if a npc throws fire and you are near a crop field, it'll burn and spread causing chaos in a split second."], "gameplay": ["This game is fantastic, i took my time going through it, there was no rush to get the bosses done and it was just fun.", "this game didn't bother me at all and more so relaxed me since there was no rush to do anything.", "other days i would explore and gather , then be ballsy trying to hit a super high level boss down when they were distracted fighting a enemy npc, other days minding my own business then having a jump scare and screaming ,full back peddle running from a 'skull' boss who happened to walk up on me.", "when i was getting near the end of the bosses that we could defeat so far, I surprised myself when i kept thinking to myself \" even when i finish... i want to do it again and start over.\""]}}},
{"steamid": "76561197991962805", "description": {"sentiment": "neutral", "features": {}}},
{"steamid": "76561198078365424", "description": {"sentiment": "unknown", "features": {}}},
{"steamid": "76561198094195941", "description": {"sentiment": "negative", "features": {"bosses": ["V Rising is a well-made survival adventure game with pretty good bosses", "sheer quantity of bosses and types of enemies you can face"], "battle mechanics": ["Battle mechanics are also pretty good in its state", "V Rising's battle mechanics are great and have potential"], "crafting": ["in the other aspects of the game such as crafting, building, and exploring the game gets stale quickly"], "exploring": ["in the other aspects of the game such as crafting, building, and exploring the game gets stale quickly", "V Rising's map isn't randomly generated so I would assume exploring the same map wouldn't be fun the second time"], "story": ["unlike games where it focuses on a spontaneously generated story, V Rising doesn't focus on the story aspect"], "skills": ["a dash of MOBA-like battle elements such as skills and camera perspective", "some of the skills are too similar to each other", "I would like to see skills that are more complementary and players should be more dependent on other players", "Players should have more specific roles in a playthrough", "Players are too versatile skill-wise no matter what skills they're using as long as they have good gear", "I suggest having three skill slots instead of two so solo players can have a chance to beat bosses alone"]}}},
{"steamid": "76561198082391351", "description": {"sentiment": "positive", "features": {"crafting": ["If you like crafting, this game is definitely for you."], "open world": ["The open world aspect of the game is really well done."]}}},
{"steamid": "76561198074052735", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198081640380", "description": {"sentiment": "positive", "features": {"combat": ["Really fun combat"], "mechanics": ["Really fun mechanics"], "early access": ["Feels pretty good for early access"]}}},
{"steamid": "76561198043734964", "description": {"sentiment": "positive", "features": {"Morbius coming out of a coffin": ["My favorite part was when Morbius came out of a coffin looked straight at the camera and said \"It's morbin time.\""]}}},
{"steamid": "76561198075858151", "description": {"sentiment": "positive", "features": {"mix of ARPG and Survival/Crafting": ["It's a perfect mix of ARPG and Survival/Crafting with a exceptionally well made learning curve."], "exceptionally well made learning curve": ["It's a perfect mix of ARPG and Survival/Crafting with a exceptionally well made learning curve."], "super polished systems": ["Super polished for an E.A. Game in it's systems."]}}},
{"steamid": "76561198032818133", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561199260816811", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198093236408", "description": {"sentiment": "positive", "features": {"combat": ["The combat is fun and fairly challenging"], "clan sharing recipes": ["I love that the clan shares all recipes"], "building": ["The building is fun", "my castle looks pretty nice now actually"]}}},
{"steamid": "76561198009127811", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198049424513", "description": {"sentiment": "positive", "features": {"combat": ["The game truly makes you feel like playing a vampire", "combat is really good"], "soundtrack": ["the soundtrack is just godlike"]}}},
{"steamid": "76561198041475592", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198345581909", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198119657559", "description": {"sentiment": null, "features": {}}},
{"steamid": "76561198069177285", "description": {"sentiment": "positive", "features": {"atmosphere": ["The game has a great atmosphere."], "gameplay": ["The game provides a serve for everyones play type.", "The game is not too grindy like other games of its type."]}}},
{"steamid": "76561197976201231", "description": {"sentiment": "negative", "features": {}}},
{"steamid": "76561198799270396", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561197996308784", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198005105573", "description": {"sentiment": "positive", "features": {}}},
{"steamid": "76561198305871905", "description": {"sentiment": "positive", "features": {"Boss Design": ["Killing a boss feels satisfying just like in Soulslike games.", "Bosses you defeat rewards you with nice skills or new crafting recipes so it helps with avoiding monotonousness even though it feels grindy later on.", "Bosses are well designed and fighting one another feels fresh enough."], "World Design": ["You have unique lands to discover and different methods of exploration like shapeshifting into a bat and flying through the sky, a wolf to run on four paws or by horse riding on your vampire form.", "Travelling is fun but still designs of the villages and towns on places you travel to are pretty much the same.", "Silverlight Hills is pretty well designed and you spend a lot of time in here since its and end game grind place."], "Building and Crafting": ["Crafting system is very good.", "Designing your base is pretty flexible since you can easily change the location of the walls and furniture.", "You can expand and come up with different ideas to build and can customize interior design with things like furniture which is fun."], "Combat": ["Your armor and weapon level is important for winning battles so grinding is a thing for combat but pvp is mostly based on skill shots and it is well balanced.", "Weapon designs are good but the lack of content still exist.", "There are 7 weapon types you can wield in V Rising: Swords, Spears, Axes, Reapers, Maces, Slashers and Crossbows and each have 2 additional skills that you get when you upgrade your weapon, it feels nice but you can't change the weapon skills.", "Weapons currently available are well balanced and well designed, i wish they add more weapon types and alternative weapon skills into the game."], "Music": ["Music is fine and fits the theme.", "Helps you feel the atmosphere especially \"The Castle Theme\" slaps so hard.", "The music is generally fine but requires a bit diversity."]}}},
